app/controllers/conversions_controller.rb

  def create
     @conversion = Conversion.new({
      user_agent: request.user_agent,
      ip_address: request.ip,
      tracker: find_tracker
    })

    respond_to do |format|
      if @conversion.save
---
INSERT INTO "conversions" ("created_at", "ip_address", "tracker_id", "updated_at", "user_agent") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-01 02:27:58.076800"], ["ip_address", "127.0.0.1"], ["tracker_id", 1], ["updated_at", "2015-02-01 02:27:58.076800"], ["user_agent", "HTTPie/0.2.5"]]