app/controllers/trackers_controller.rb

  def index
    @trackers    = current_user.trackers.order(created_at: :desc)
    @tracker     = Tracker.new(user_id: current_user.id)

    redirect_to new_tracker_path unless @trackers.present?
---
SELECT "trackers".* FROM "trackers"